import React from 'react'
import { Link } from 'react-router-dom'

const Post = () => {
  return (
   <div className='post'>
    <div className='image'>
        <Link to={"post/1"}>
         <img src='https://thethaiger.com/th/wp-content/uploads/2023/12/%E0%B8%AA%E0%B8%A3%E0%B8%B8%E0%B8%9B%E0%B8%94%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B9%88%E0%B8%B2%E0%B9%80%E0%B8%81%E0%B8%A1-The-Day-Before-%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%87%E0%B8%AA%E0%B8%95%E0%B8%B9%E0%B8%94%E0%B8%B4%E0%B9%82%E0%B8%AD-FNTASTIC-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%81%E0%B8%B2%E0%B8%A8%E0%B8%9B%E0%B8%B4%E0%B8%94%E0%B8%95%E0%B8%B1%E0%B8%A7.png'
         alt=""
         />
        </Link>
    </div>
    <div className='texts'>
        <Link>
        <h2>
        ทีมสร้าง "The Day Before" ปิดสตูดิโอหนี ปล่อยผู้เล่นยืนงงในดงผี!
        </h2>
        </Link>
        <p className='info'>
            <a href='' className='author'>
                @Naphat
            </a>
            <time>13 December 2023</time>
        </p>
        <p className='summary'>
        เรียกว่าเป็นไปตามคาด สำหรับ The Day Before วิดีโอเกมแนวชูตติ้งสยองขวัญเอาชีวิตรอดเน้นเล่นออนไลน์หลายคน 
        ที่ถูกสร้างโดยทีมงาน Fntastic และเผยแพร่โดยค่าย Mytona ซึ่งก่อนหน้าเคยเผชิญดราม่าจากปัญหาการพัฒนาเกมที่ยืดยาวกินเวลานานผิดสังเกต
        จนถูกสังคมตั้งคำถามและวิพากษ์วิจารณ์ไปต่างๆนานาว่านี่อาจเข้าข่ายเป็นการต้มตุ๋นหลอกลวงตั้งแต่ตัวเกมยังไม่ทันวางจำหน่าย
        และแล้วทุกสิ่งที่แฟนๆเคลือบแคลงสงสัยก็เริ่มออกลายชัดเจนมากยิ่งขึ้น เมื่อตัวเกม The Day Before ได้ฤกษ์เปิดช่วง Early Access ให้ผู้เล่นชาวสตีมได้ลิ้มลองสัมผัสมันก่อนใครล่วงหน้าในวันที่ 7 ธันวาคมที่ผ่านมา 
        พร้อมกับเสียงตอบรับที่ย่ำแย่ค่อนไปทางแง่ลบเป็นส่วนใหญ่ถึงความไม่สมบูรณ์ของระบบเกมเพลย์จนน่าตกใจ ทั้งอาการกระตุก หลุดบ่อย ของหาย และบัคอื่นๆอีกมากมายก่ายกอง
        ซึ่งแทนที่ทีมงานจะตั้งหน้าตั้งตาปล่อยแพทช์ปรับปรุงแก้ไขตัวเกมให้ดีขึ้นเหมือนเช่นนักพัฒนารายอื่นๆ ตรงกันข้ามทาง Fntastic กลับเลือกที่จะตัดช่องน้อยแต่พอตัวด้วยการรีบชิงประกาศปิดสตูดิโอของพวกเขาเองไปเสียเลย 
        ณ บัดนี้ โดยอ้างเหตุผลว่ามันเกิดจากปัญหาด้านการเงินภายในของบริษัท

        </p>
    </div>
   </div>
  )
}

export default Post