import React from 'react'
import { Link } from 'react-router-dom'

const Post = () => {
  return (
   <div className='post'>
    <div className='image'>
        <Link>
         <img src='https://mpics.mgronline.com/pics/Images/566000011294801.JPEG'
         alt=""
         />
        </Link>
    </div>
    <div className='texts'>
        <Link>
        <h2>
        ทีมสร้าง "The Day Before" ปิดสตูดิโอหนี ปล่อยผู้เล่นยืนงงในดงผี!
        </h2>
        </Link>
        <p className='info'>
            <a href='' className='author'>
                @Naphat
            </a>
            <time>13 ธันวาคม 2565</time>
        </p>
        <p className='summary'>
        เรียกว่าเป็นไปตามคาด สำหรับ The Day Before วิดีโอเกมแนวชูตติ้งสยองขวัญเอาชีวิตรอดเน้นเล่นออนไลน์หลายคน 
        ที่ถูกสร้างโดยทีมงาน Fntastic และเผยแพร่โดยค่าย Mytona ซึ่งก่อนหน้าเคยเผชิญดราม่าจากปัญหาการพัฒนาเกมที่ยืดยาวกินเวลานานผิดสังเกต
        จนถูกสังคมตั้งคำถามและวิพากษ์วิจารณ์ไปต่างๆนานาว่านี่อาจเข้าข่ายเป็นการต้มตุ๋นหลอกลวงตั้งแต่ตัวเกมยังไม่ทันวางจำหน่าย
        และแล้วทุกสิ่งที่แฟนๆเคลือบแคลงสงสัยก็เริ่มออกลายชัดเจนมากยิ่งขึ้น เมื่อตัวเกม The Day Before ได้ฤกษ์เปิดช่วง Early Access ให้ผู้เล่นชาวสตีมได้ลิ้มลองสัมผัสมันก่อนใครล่วงหน้าในวันที่ 7 ธันวาคมที่ผ่านมา 
        พร้อมกับเสียงตอบรับที่ย่ำแย่ค่อนไปทางแง่ลบเป็นส่วนใหญ่ถึงความไม่สมบูรณ์ของระบบเกมเพลย์จนน่าตกใจ ทั้งอาการกระตุก หลุดบ่อย ของหาย และบัคอื่นๆอีกมากมายก่ายกอง
        ซึ่งแทนที่ทีมงานจะตั้งหน้าตั้งตาปล่อยแพทช์ปรับปรุงแก้ไขตัวเกมให้ดีขึ้นเหมือนเช่นนักพัฒนารายอื่นๆ ตรงกันข้ามทาง Fntastic กลับเลือกที่จะตัดช่องน้อยแต่พอตัวด้วยการรีบชิงประกาศปิดสตูดิโอของพวกเขาเองไปเสียเลย 
        ณ บัดนี้ โดยอ้างเหตุผลว่ามันเกิดจากปัญหาด้านการเงินภายในของบริษัท

        </p>
    </div>






   </div>
  )
}

export default Post